Repository: LesGrob/weather_mobile
Catalog: weather_ui_core/lib/localization/l10n/localization_*.arb
Languages: ru

# initErrorTitle
source: Something went wrong! Please try again later.
ru: Что-то пошло не так! Повторите попытку позже.

# weatherScreenTitle
source: Weather
ru: Погода

# weatherScreenSearchLabel
source: Select City
ru: Выберите город

# weatherScreenEmptyTitle
source: Select city to display weather.
ru: Выберите город, чтобы отобразить данные

# weatherScreenLoadingTitle
source: Weather data is loading.
ru: Данные о погоде загружаются.

# weatherScreenNoData
source: No weather for current city.
ru: Нет данным о погоде в выбранном городе.

# tempBlockText
source: {temp} 째C
ru: {temp} °C

# fellsLikeBlockText
source: Fells like: {temp} 째C
ru: Ощущается как: {temp} °C

# minTempBlockText
source: Min temp: {temp} 째C
ru: Мин температура: {temp} °C

# maxTempBlockText
source: Max temp: {temp} 째C
ru: Макс температура: {temp} °C

# windSpeedBlockText
source: Wind speed: {speed} m/s
ru: Скорость ветра: {speed} m/s

# pressureBlockText
source: Pressure: {pressure} hPa
ru: Давление: {pressure} hPa

# humidityBlockText
source: Humidity: {humidity} %
ru: Влажность: {humidity} %

# visibilityBlockText
source: Visibility: {visibility} m
ru: Видимость: {visibility} м
